
def area(a):
    """
    Функция считает площадь квадрата.

    Параметры
    ----------
    a : int
        Сторона квадрата

    Возвращает
    -------
    int
        Площадь квадрата
    
    Пример
    --------

    .. code-block:: python

    res = area(10)
    print(res)        # 100

    """
    return a * a


def perimeter(a):
    """
    Функция считает периметр квадрата.

    Параметры
    ----------
    a : int
        Сторона квадрата

    Возвращает
    -------
    int
        Периметр квадрата
    
    Пример
    --------

    .. code-block:: python

    res = perimeter(10)
    print(res)        # 40

    """
    return 4 * a
